In [2]:
import pandas as pd
import scipy.stats as stats

In [ ]:
# Q1. A physician is evaluating a new diet for her patients with a family history of heart disease. 
#To test the effectiveness of this diet, 16 patients are placed on the diet for 6 months. Their weights and
#triglyceride levels are measured before and after the study, and the physician wants to know if either set of 
#measurements has changed.

In [33]:
diet=pd.read_csv('C:/Users/DELL-IN/Downloads/Video/AL/8/Stats - 2 [Effect Size]/Stats - 2 [Effect Size]/Basic Statistics Assignment/dietstudy.csv')

In [34]:
diet.head()

   patid  age  gender  tg0  tg1  tg2  tg3  tg4  wgt0  wgt1  wgt2  wgt3  wgt4
0      1   45    Male  180  148  106  113  100   198   196   193   188   192
1      2   56    Male  139   94  119   75   92   237   233   232   228   225
2      3   50    Male  152  185   86  149  118   233   231   229   228   226
3      4   46  Female  112  145  136  149   82   179   181   177   174   172
4      5   64    Male  156  104  157   79   97   219   217   215   213   214

In [35]:
print(diet.tg0.mean())
print(diet.tg4.mean())

138.4375
124.375

In [36]:
#paired sample t-test
stats.ttest_rel(a=diet.tg0, b=diet.tg4) 
# we couldn't reject null hypothesis at 99% significance level but sample shows tg0>tg4

Ttest_relResult(statistic=1.2000008533342437, pvalue=0.24874946576903698)

In [37]:
print(diet.wgt0.mean())
print(diet.wgt4.mean())

198.375
190.3125

In [38]:
#paired sample t-test
stats.ttest_rel(a=diet.wgt0,b=diet.wgt4)  
# we reject null hypothesis at 99% significance level but sample shows wgt0>wgt4

Ttest_relResult(statistic=11.174521688532522, pvalue=1.137689414996614e-08)

In [ ]:
# Q.2 An analyst at a department store wants to evaluate a recent credit card promotion. 
#To this end, 500 cardholders were randomly selected. Half received an ad promoting a reduced interest rate on purchases
#made over the next three months, and half received a standard seasonal ad. Is the promotion effective to increase sales?

In [47]:
credit=pd.read_csv('C:/Users/DELL-IN/Downloads/Video/AL/8/Stats - 2 [Effect Size]/Stats - 2 [Effect Size]/Basic Statistics Assignment/creditpromo.csv')

In [48]:
credit.head()

   new_promotion     standard
0    1403.807542  2232.771979
1    1513.563200  2327.092181
2    1729.627996  1280.030541
3    1609.705918  1476.624884
4    1854.489028  1460.769753

In [49]:
print(credit.new_promotion.mean())
print(credit.standard.mean())

1637.4999830655995
1566.3890309792007

In [50]:
#paired sample t-test
stats.ttest_rel(a=credit.new_promotion, b=credit.standard)  
# purchase made over new production is greater than purchase made over standard with 99% significance level

Ttest_relResult(statistic=2.293270932564695, pvalue=0.022666277277748385)

In [51]:
# Q.3 An experiment is conducted to study the hybrid seed production of bottle gourd under open field conditions.
#The main aim of the investigation is to compare natural pollination and hand pollination. 
#The data are collected on 10 randomly selected plants from each of natural pollination and hand pollination. 
#The data are collected on fruit weight (kg), seed yield/plant (g) and seedling length (cm). (Data set: pollination.csv)
#a. Is the overall population of Seed yield/plant (g) equals to 200?
#b. Test whether the natural pollination and hand pollination under open field conditions are equally effective 
#   or are significantly different.

In [52]:
pollination=pd.read_csv('C:/Users/DELL-IN/Downloads/Video/AL/8/Stats - 2 [Effect Size]/Stats - 2 [Effect Size]/Basic Statistics Assignment/pollination.csv')

In [53]:
pollination.head()

     Group  Fruit_Wt  Seed_Yield_Plant  Seedling_length
0  Natural      1.85            147.70            16.86
1  Natural      1.86            136.86            16.77
2  Natural      1.83            149.97            16.35
3  Natural      1.89            172.33            18.26
4  Natural      1.80            144.46            17.90

In [55]:
print(pollination.Seed_Yield_Plant.mean())

180.8035

In [57]:
#one sample t-test
stats.ttest_1samp(a= pollination.Seed_Yield_Plant,               
                 popmean= 200)
# p=0.03 we cannot accept null at 90% significance level. No, the overall population cannot equal to 200

Ttest_1sampResult(statistic=-2.3009121248548645, pvalue=0.032891040921283025)

In [69]:
polli_data=pd.read_csv('C:/Users/DELL-IN/Downloads/Video/AL/8/Stats - 2 [Effect Size]/Stats - 2 [Effect Size]/Basic Statistics Assignment/polli_data.csv',sep='\t')

In [70]:
polli_data.head(10)

     F1    F2  seed_y1  seed_y2  seed_length1  seed_length2
0  1.85  2.58   147.70   224.26         16.86         18.18
1  1.86  2.74   136.86   197.50         16.77         18.07
2  1.83  2.58   149.97   230.34         16.35         19.07
3  1.89  2.62   172.33   217.05         18.26         19.00
4  1.80  2.68   144.46   233.84         17.90         18.00
5  1.88  2.56   138.30   216.52         16.95         18.49
6  1.89  2.34   150.58   211.93         18.15         17.45
7  1.79  2.67   140.99   210.37         18.86         18.97
8  1.85  2.45   140.57   199.87         18.39         19.31
9  1.84  2.44   138.33   214.30         18.58         19.36

In [71]:
stats.ttest_rel(a=polli_data.F1,b=polli_data.F2)
#p<0.01 reject null with 99% significance level (different)

Ttest_relResult(statistic=-16.003484109505287, pvalue=6.420421224715851e-08)

In [72]:
stats.ttest_rel(a=polli_data.seed_y1,b=polli_data.seed_y2)
#p<0.01 reject null with 99% significance level (different)

Ttest_relResult(statistic=-16.80079294985747, pvalue=4.198813240596638e-08)

In [73]:
stats.ttest_rel(a=polli_data.seed_length1,b=polli_data.seed_length2)
#p>0.01 can't reject the null with 99% significance level (equally effective)

Ttest_relResult(statistic=-2.9765905136151303, pvalue=0.015535315669362245)

In [1]:
# Q 4
#An electronics firm is developing a new DVD player in response to customer requests. 
#Using a prototype, the marketing team has collected focus data for different age groups viz. 
#Under 25; 25-34; 35-44; 45-54; 55-64; 65 and above. Do you think that consumers of various ages rated the design differently?

In [3]:
dvd=pd.read_csv('C:/Users/DELL-IN/Downloads/Video/AL/8/Stats - 2 [Effect Size]/Stats - 2 [Effect Size]/Basic Statistics Assignment/dvdplayer.csv')

In [4]:
dvd.head()

      agegroup   dvdscore
0  65 and over  38.454803
1        55-64  17.669677
2  65 and over  31.704307
3  65 and over  25.924460
4     Under 25  30.450007

In [6]:
dvd.agegroup.value_counts()

65 and over    17
Under 25       13
35-44          12
25-34          10
45-54          10
55-64           6
Name: agegroup, dtype: int64

In [8]:
g1=dvd.dvdscore[dvd.agegroup=='65 and over']
g2=dvd.dvdscore[dvd.agegroup=='Under 25']
g3=dvd.dvdscore[dvd.agegroup=='35-44']
g4=dvd.dvdscore[dvd.agegroup=='25-34']
g5=dvd.dvdscore[dvd.agegroup=='45-54']
g6=dvd.dvdscore[dvd.agegroup=='55-64']

stats.f_oneway(g1,g2,g3,g4,g5,g6)

F_onewayResult(statistic=6.992526962676514, pvalue=3.087324905679639e-05)

In [13]:
print(g1.mean())
print(g2.mean())
print(g3.mean())
print(g4.mean())
print(g5.mean())
print(g6.mean())

28.00279130552502
28.749228425584857
37.018058228022774
31.67800994228487
39.1183687318563
28.447335692086785

In [ ]:
#p=0.02
# we have accepted the alternate with 90% significance level and sample shows customer of diff. age groups behave differently
# we couldn't reject null with 95% significance level but sample rated the diff. age groups behave differently

In [ ]:
# Q. 5
#A survey was conducted among 2800 customers on several demographic characteristics. Working status, sex, age, age-group, race, happiness, no. of child, marital status, educational qualifications, income group etc. had been captured for that purpose. (Data set: sample_survey.csv).
#a. Is there any relationship in between labour force status with marital status?
#b. Do you think educational qualification is somehow controlling the marital status?
#c. Is happiness is driven by earnings or marital status?

In [14]:
survey=pd.read_csv('C:/Users/DELL-IN/Downloads/Video/AL/8/Stats - 2 [Effect Size]/Stats - 2 [Effect Size]/Basic Statistics Assignment/sample_survey.csv')

In [15]:
survey.head()

,id,wrkstat,marital,childs,age,educ,paeduc,maeduc,speduc,degree,...,agecat,childcat,news1,news2,news3,news4,news5,car1,car2,car3
0,1,Working full time,Divorced,2.0,60.0,12.0,12.0,12.0,NaN,High school,...,55 to 64,1-2,No,No,No,No,No,American,Japanese,Japanese
1,2,Working part-time,Never married,0.0,27.0,17.0,20.0,NaN,NaN,Junior college,...,25 to 34,None,No,No,Yes,No,No,American,German,Japanese
2,3,Working full time,Married,2.0,36.0,12.0,12.0,12.0,16.0,High school,...,35 to 44,1-2,No,No,No,Yes,Yes,American,American,NaN
3,4,Working full time,Never married,0.0,21.0,13.0,NaN,12.0,NaN,High school,...,Less than 25,None,No,No,No,Yes,Yes,American,Other,NaN
4,5,Working full time,Never married,0.0,35.0,16.0,NaN,12.0,NaN,Bachelor,...,35 to 44,None,No,No,No,No,No,American,American,Korean

In [21]:
a=pd.crosstab(survey.marital,survey.wrkstat,margins=True)
a

wrkstat,Keeping house,Other,Retired,School,Temporarily not working,"Unemployed, laid off",Working full time,Working part-time,All
marital,,,,,,,,,
Divorced,25,12,53,7,9,10,295,35,446
Married,200,16,168,9,23,13,778,138,1345
Never married,35,14,17,60,11,32,392,102,663
Separated,13,4,6,2,1,0,58,9,93
Widowed,55,8,150,1,2,3,44,20,283
All,328,54,394,79,46,58,1567,304,2830

In [22]:
stats.chi2_contingency(observed=a)

#sig level=90%
# no relationship b/w labour force and marital status

(729.2421426572284,
 1.820339965538765e-127,
 40,
 array([[5.16918728e+01, 8.51024735e+00, 6.20932862e+01, 1.24501767e+01,
         7.24946996e+00, 9.14063604e+00, 2.46954770e+02, 4.79095406e+01,
         4.46000000e+02],
        [1.55886926e+02, 2.56643110e+01, 1.87254417e+02, 3.75459364e+01,
         2.18621908e+01, 2.75653710e+01, 7.44740283e+02, 1.44480565e+02,
         1.34500000e+03],
        [7.68424028e+01, 1.26508834e+01, 9.23045936e+01, 1.85077739e+01,
         1.07766784e+01, 1.35879859e+01, 3.67109894e+02, 7.12197880e+01,
         6.63000000e+02],
        [1.07787986e+01, 1.77455830e+00, 1.29477032e+01, 2.59611307e+00,
         1.51166078e+00, 1.90600707e+00, 5.14950530e+01, 9.99010601e+00,
         9.30000000e+01],
        [3.28000000e+01, 5.40000000e+00, 3.94000000e+01, 7.90000000e+00,
         4.60000000e+00, 5.80000000e+00, 1.56700000e+02, 3.04000000e+01,
         2.83000000e+02],
        [3.28000000e+02, 5.40000000e+01, 3.94000000e+02, 7.90000000e+01,
         4.60000000e+01, 5.80000000e+01, 1.56700000e+03, 3.04000000e+02,
         2.83000000e+03]]))

In [23]:
b=pd.crosstab(survey.marital,survey.degree,margins=True)
b

degree,Bachelor,Graduate,High school,Junior college,LT High school,All
marital,,,,,,
Divorced,58,29,241,45,70,443
Married,251,123,686,108,174,1342
Never married,129,41,367,46,77,660
Separated,12,3,58,3,17,93
Widowed,28,9,148,6,92,283
All,478,205,1500,208,430,2821

In [24]:
stats.chi2_contingency(observed=b)

#sig level=90%
# no relationship b/w educational qualification and marital status

(122.68449020508541,
 7.424404099753273e-15,
 25,
 array([[  75.06345268,   32.19248493,  235.55476781,   32.66359447,
           67.52570011,  443.        ],
        [ 227.39312301,   97.52215526,  713.57674583,   98.94930876,
          204.55866714, 1342.        ],
        [ 111.83268345,   47.9617157 ,  350.9393832 ,   48.66359447,
          100.60262318,  660.        ],
        [  15.75824176,    6.75824176,   49.45054945,    6.85714286,
           14.17582418,   93.        ],
        [  47.95249911,   20.56540234,  150.4785537 ,   20.86635945,
           43.1371854 ,  283.        ],
        [ 478.        ,  205.        , 1500.        ,  208.        ,
          430.        , 2821.        ]]))

In [33]:
c1=pd.crosstab(survey.happy,survey.income,margins=True)
c1

income,$1000 TO 2999,$10000 - 14999,$15000 - 19999,$20000 - 24999,$25000 or more,$3000 TO 3999,$4000 TO 4999,$5000 TO 5999,$6000 TO 6999,$7000 TO 7999,$8000 TO 9999,LT $1000,All
happy,,,,,,,,,,,,,
Not too happy,7,39,33,40,113,9,9,6,14,12,9,11,302
Pretty happy,20,107,119,155,888,11,13,18,13,21,30,13,1408
Very happy,5,44,26,50,571,4,10,11,6,14,19,11,771
All,32,190,178,245,1572,24,32,35,33,47,58,35,2481

In [34]:
c2=pd.crosstab(survey.happy,survey.marital,margins=True)
c2

marital        Divorced  Married  Never married  Separated  Widowed   All
happy
Not too happy        72       71            108         30       59   340
Pretty happy        278      684            426         49      137  1574
Very happy           93      582            120         13       83   891
All                 443     1337            654         92      279  2805

In [35]:
stats.chi2_contingency(observed=c1)

(178.95053061216427,
 7.234749067043371e-21,
 36,
 array([[   3.89520355,   23.12777106,   21.66706973,   29.82265216,
          191.35187424,    2.92140266,    3.89520355,    4.26037888,
            4.01692866,    5.72108021,    7.06005643,    4.26037888,
          302.        ],
        [  18.16041919,  107.82748892,  101.01733172,  139.04070939,
          892.1305925 ,   13.62031439,   18.16041919,   19.86295848,
           18.72793229,   26.67311568,   32.91575977,   19.86295848,
         1408.        ],
        [   9.94437727,   59.04474002,   55.31559855,   76.13663845,
          488.51753325,    7.45828295,    9.94437727,   10.87666264,
           10.25513906,   14.60580411,   18.0241838 ,   10.87666264,
          771.        ],
        [  32.        ,  190.        ,  178.        ,  245.        ,
         1572.        ,   24.        ,   32.        ,   35.        ,
           33.        ,   47.        ,   58.        ,   35.        ,
         2481.        ]]))

In [36]:
stats.chi2_contingency(observed=c2)

#sig level=90%
# happiness is neither driven by earning nor by marital status

(260.68943894182826,
 7.762777322980048e-47,
 15,
 array([[  53.6969697 ,  162.06060606,   79.27272727,   11.15151515,
           33.81818182,  340.        ],
        [ 248.58538324,  750.24527629,  366.98609626,   51.62495544,
          156.55828877, 1574.        ],
        [ 140.71764706,  424.69411765,  207.74117647,   29.22352941,
           88.62352941,  891.        ],
        [ 443.        , 1337.        ,  654.        ,   92.        ,
          279.        , 2805.        ]]))